{
    "pae": 13.6,
    "iptm": 39.1,
    "pdockq": 0.025,
    "proA": "FBpp0073135",
    "proB": "FBpp0082996",
    "geneA": "wit",
    "geneB": "Dlc90F",
    "annotationA": "Transforming growth factor beta receptor activity, type II; protein kinase activity; ATP binding; receptor signaling protein serine/threonine kinase activity; transforming growth factor beta-activated receptor activity. It is involved in the biological process described with: transmembrane receptor protein serine/threonine kinase signaling pathway; regulation of synaptic growth at neuromuscular junction; protein phosphorylation; neuromuscular junction development; lateral inhibition; positive regulation of synaptic growth at neuromuscular junction; dendrite morphogenesis; neuromuscular [...] ",
    "annotationB": "Dynein light chain Tctex-type; Acts as one of several non-catalytic accessory components of the cytoplasmic dynein complex that are thought to be involved in linking dynein to cargos and to adapter proteins that regulate dynein function. Cytoplasmic dynein acts as a motor for the intracellular retrograde motility of vesicles and organelles along microtubules. Required for spermatid differentiation. Is not required for polarized transport in rhabdomere development and appears to be a non-essential component of the cytoplasmic dynein complex",
    "ppi": "no or low",
    "interfaceA_sel": [
        {
            "struct_asym_id": "A",
            "start_residue_number": 511,
            "end_residue_number": 511,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        },
        {
            "struct_asym_id": "A",
            "start_residue_number": 637,
            "end_residue_number": 637,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceB_sel": [
        {
            "struct_asym_id": "B",
            "start_residue_number": 77,
            "end_residue_number": 77,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        },
        {
            "struct_asym_id": "B",
            "start_residue_number": 92,
            "end_residue_number": 92,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceA": [
        "511-511",
        "637-637"
    ],
    "interfaceB": [
        "77-77",
        "92-92"
    ]
}