{
    "pae": 7.5,
    "iptm": 22.9,
    "pdockq": 0.172,
    "proA": "FBpp0075123",
    "proB": "FBpp0290499",
    "geneA": "tra",
    "geneB": "fru",
    "annotationA": "Female-specific protein transformer; Member of the regulatory pathway controlling female somatic sexual differentiation, regulated by Sxl. Activates dsx female-specific splicing by promoting the formation of a splicing enhancer complex which consists of tra, tra2 and sr proteins. Together with tra-2, plays a role in switching fru splicing from the male-specific pattern to the female-specific pattern through activation of the female-specific fru 5'-splice site. No known function in males",
    "annotationB": "Sex determination protein fruitless; Probably acts as a transcriptional regulator. Part of the somatic sex determination hierarchy; sex determination genes transformer (tra) and transformer-2 (tra-2) switch fru splicing from the male-specific pattern to the female-specific pattern through activation of the female-specific fru 5'-splice site. Vital for the development of males and females. Controls the development of the male specific abdominal muscle of Lawrence. Plays a role in male courtship behavior and sexual orientation. Enhances male-specific expression of takeout in brain-associ [...] ",
    "ppi": "no or low",
    "interfaceA_sel": [
        {
            "struct_asym_id": "A",
            "start_residue_number": 130,
            "end_residue_number": 147,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceB_sel": [
        {
            "struct_asym_id": "B",
            "start_residue_number": 160,
            "end_residue_number": 180,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        },
        {
            "struct_asym_id": "B",
            "start_residue_number": 205,
            "end_residue_number": 214,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceA": [
        "130-147"
    ],
    "interfaceB": [
        "160-180",
        "205-214"
    ]
}