{
    "pae": 17.1,
    "iptm": 21.3,
    "pdockq": 0.023,
    "proA": "FBpp0082682",
    "proB": "FBpp0293344",
    "geneA": "Akt1",
    "geneB": "ird5",
    "annotationA": "RAC serine/threonine-protein kinase; Serine/threonine kinase involved in various developmental processes. During early embryogenesis, acts as a survival protein. During mid-embryogenesis, phosphorylates and activates trh, a transcription factor required for tracheal cell fate determination. Also regulates tracheal cell migration. Later in development, acts downstream of PI3K and Pk61C/PDK1 in the insulin receptor transduction pathway which regulates cell growth and organ size, by phosphorylating and antagonizing FOXO transcription factor. Controls follicle cell size during oogenesis. M [...] ",
    "annotationB": "Inhibitor of nuclear factor kappa-B kinase subunit beta; Required for the activation of the NF-kappa-B factor Relish (Rel) by acting as an essential signaling component in transmitting the lipopolysaccharide (LPS) signal leading to cact degradation, which is required for direct activation of Rel. Phosphorylates inhibitors of NF-kappa-B (cact) thus leading to the dissociation of the inhibitor/NF-kappa-B complex and ultimately the degradation of the NF-kappa-B inhibitor. Essential for antibacterial immune response",
    "ppi": "no or low",
    "interfaceA_sel": [
        {
            "struct_asym_id": "A",
            "start_residue_number": 233,
            "end_residue_number": 233,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceB_sel": [
        {
            "struct_asym_id": "B",
            "start_residue_number": 175,
            "end_residue_number": 175,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceA": [
        "233-233"
    ],
    "interfaceB": [
        "175-175"
    ]
}