{
    "pae": 15.1,
    "iptm": 20.6,
    "pdockq": 0.025,
    "proA": "FBpp0080441",
    "proB": "FBpp0305095",
    "geneA": "grp",
    "geneB": "Hsp83",
    "annotationA": "Serine/threonine-protein kinase grp; Serine/threonine-protein kinase which is required for checkpoint-mediated cell cycle arrest and activation of DNA repair in response to the presence of DNA damage or unreplicated DNA. May also negatively regulate cell cycle progression during unperturbed cell cycles. May phosphorylate the CDC25 phosphatase stg, which promotes its degradation. This results in increased inhibitory tyrosine phosphorylation of Cdk1-cyclin complexes and consequent inhibition of cell cycle progression",
    "annotationB": "Heat shock protein 83; Molecular chaperone that promotes the maturation, structural maintenance and proper regulation of specific target proteins involved for instance in cell cycle control and signal transduction. Undergoes a functional cycle that is linked to its ATPase activity. This cycle probably induces conformational changes in the client proteins, thereby causing their activation. Interacts dynamically with various co-chaperones that modulate its substrate recognition, ATPase cycle and chaperone function. Together with Hop and piwi, mediates canalization, also known as developm [...] ",
    "ppi": "no or low",
    "interfaceA_sel": [
        {
            "struct_asym_id": "A",
            "start_residue_number": 176,
            "end_residue_number": 177,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceB_sel": [
        {
            "struct_asym_id": "B",
            "start_residue_number": 717,
            "end_residue_number": 717,
            "representation": "ball-and-stick",
            "sideChain": false,
            "color": {
                "r": 247,
                "g": 171,
                "b": 0
            },
            "focus": true
        }
    ],
    "interfaceA": [
        "176-177"
    ],
    "interfaceB": [
        "717-717"
    ]
}